jspark311/ManuvrPlatforms/ESP32/src/MQTT.cpp
/*
File:   MQTT.cpp
Author: J. Ian Lindsay
Date:   2025.12.27

This file contains a reusable wrapper for the ESP32's MQTT features.

MQTT does NOT register for IP stack events.
Network readiness is queried from ESP32Radio via injected pointer.
MQTT connection truth is mailbox-driven from ESP-MQTT event handler.
*/

#include "../ESP32.h"

#if defined(__BUILD_HAS_CBOR)
  #include "cbor-cpp/cbor.h"
#endif

#if !defined(CONFIG_MQTT_PROTOCOL_5)
  #error "This driver requires CONFIG_MQTT_PROTOCOL_5. Enable it in menuconfig (Component config → MQTT → MQTT Protocol v5)."
#endif

// TODO: Test for MQTT_TRANSPORT_SSL MQTT_TRANSPORT_WS and sec variants, and
//   build support accordingly. This is mostly to save weight in the binary,
//   but will also prevent surprises at runtime attributable to missing support.

/*******************************************************************************
*      _______.___________.    ___   .___________. __    ______     _______.
*     /       |           |   /   \  |           ||  |  /      |   /       |
*    |   (----`---|  |----`  /  ^  \ `---|  |----`|  | |  ,----'  |   (----`
*     \   \       |  |      /  /_\  \    |  |     |  | |  |        \   \
* .----)   |      |  |     /  _____  \   |  |     |  | |  `----.----)   |
* |_______/       |__|    /__/     \__\  |__|     |__|  \______|_______/
*
* Static members and initializers should be located here.
*******************************************************************************/

const EnumDef<MQTTCliState> _STATE_LIST[] = {
  { MQTTCliState::UNINIT,        "UNINIT"},
  { MQTTCliState::INIT,          "INIT"},
  { MQTTCliState::CONNECTING,    "CONNECTING"},
  { MQTTCliState::CONNECTED,     "CONNECTED"},
  { MQTTCliState::DISCONNECTING, "DISCONNECTING"},
  { MQTTCliState::DISCONNECTED,  "DISCONNECTED"},
  { MQTTCliState::FAULT,         "FAULT"},
  { MQTTCliState::INVALID,       "INVALID", (ENUM_WRAPPER_FLAG_CATCHALL)}  // FSM hygiene.
};
const EnumDefList<MQTTCliState> _FSM_STATES(&_STATE_LIST[0], (sizeof(_STATE_LIST) / sizeof(_STATE_LIST[0])), "MQTTCliState");



/*******************************************************************************
* ESP-MQTT event handler
* NOTE: This is running inside ESP-IDF's event loop task. It must not call into
*   FSM route APIs. It *may* set mailboxes.
*******************************************************************************/
void mqtt_event_handler(void* handler_args, esp_event_base_t base, int32_t event_id, void* event_data) {
  static const char* const TAG = "mqtt_event_handler";
  ESP_LOGD(TAG, "Event dispatched from event loop base=%s, event_id=%" PRIi32 "", base, event_id);

  esp_mqtt_event_handle_t event = (esp_mqtt_event_handle_t) event_data;
  esp_mqtt_client_handle_t client = event->client;
  MQTTClientESP32* self = (MQTTClientESP32*) handler_args;

  int msg_id;

  switch ((esp_mqtt_event_id_t) event_id) {
    case MQTT_EVENT_CONNECTED:
      ESP_LOGI(TAG, "MQTT_EVENT_CONNECTED");
      if (nullptr != self) {
        self->_mb_set_mqtt_connected(true);
        self->_mb_set_mqtt_disconnected(false);
      }
      break;

    case MQTT_EVENT_DISCONNECTED:
      ESP_LOGI(TAG, "MQTT_EVENT_DISCONNECTED");
      if (nullptr != self) {
        self->_mb_set_mqtt_connected(false);
        self->_mb_set_mqtt_disconnected(true);
      }
      break;

    case MQTT_EVENT_SUBSCRIBED:
      ESP_LOGI(TAG, "MQTT_EVENT_SUBSCRIBED, msg_id=%d", event->msg_id);
      break;

    case MQTT_EVENT_UNSUBSCRIBED:
      ESP_LOGI(TAG, "MQTT_EVENT_UNSUBSCRIBED, msg_id=%d", event->msg_id);
      break;

    case MQTT_EVENT_PUBLISHED:
      ESP_LOGI(TAG, "MQTT_EVENT_PUBLISHED, msg_id=%d", event->msg_id);
      break;

    case MQTT_EVENT_DATA:
      ESP_LOGI(TAG, "MQTT_EVENT_DATA");
      printf("TOPIC=%.*s\r\n", event->topic_len, event->topic);
      printf("DATA=%.*s\r\n", event->data_len, event->data);
      break;

    case MQTT_EVENT_ERROR:
      ESP_LOGI(TAG, "MQTT_EVENT_ERROR");
      if (nullptr != self) {
        self->_mb_set_mqtt_connected(false);
        self->_mb_set_mqtt_disconnected(true);
        if (nullptr != event->error_handle) {
          switch (event->error_handle->error_type) {
            case MQTT_ERROR_TYPE_NONE:  break;  // Explicitly ignored.

            case MQTT_ERROR_TYPE_CONNECTION_REFUSED:
              switch (event->error_handle->connect_return_code) {
                // These failures should permanently disable greedy reconnect.
                case MQTT_CONNECTION_REFUSE_BAD_USERNAME:
                case MQTT_CONNECTION_REFUSE_NOT_AUTHORIZED:
                case MQTT_CONNECTION_REFUSE_PROTOCOL:
                  self->_current_broker.autoconnect(false);
                  break;

                case MQTT_CONNECTION_REFUSE_ID_REJECTED:
                case MQTT_CONNECTION_REFUSE_SERVER_UNAVAILABLE:
                  // Currently ignored, but explicitly acknowledged.
                default:   // Future or unknown connection-refused reasons.
                  ESP_LOGW(TAG, "Unhandled MQTT CONNECTION_REFUSED: (connect_return_code = %u)", (event->error_handle->connect_return_code));
                  break;
              }
              break;

            case MQTT_ERROR_TYPE_TCP_TRANSPORT:
              ESP_LOGW(TAG, "Unhandled MQTT_ERROR_TYPE_TCP_TRANSPORT: (%s)", strerror(event->error_handle->esp_transport_sock_errno));
              break;

            case MQTT_ERROR_TYPE_SUBSCRIBE_FAILED:
              ESP_LOGW(TAG, "MQTT_ERROR_TYPE_SUBSCRIBE_FAILED");
              break;

            // Future ESP-IDF error types land here.
            default:
              ESP_LOGW(TAG, "Unhandled error_type: (%u)", event->error_handle->error_type);
              break;
          }
        }
      }
      break;

    case MQTT_EVENT_BEFORE_CONNECT:
      if (nullptr != self) {
        esp_mqtt5_connection_property_config_t conn_prop = {0};
        conn_prop.maximum_packet_size = MQTT_MAX_PACKET_SIZE;
        // Note: API takes esp_mqtt5_client_handle_t, but the handle type is compatible in ESP-MQTT.
        esp_mqtt5_client_set_connect_property((esp_mqtt5_client_handle_t) client, &conn_prop);
      }
      break;

    default:
      ESP_LOGI(TAG, "Other event id:%d", event->event_id);
      break;
  }
}



