jspark311/ManuvrPlatforms/ESP32/src/MQTT.cpp
/*******************************************************************************
* MQTTBrokerDefESP32
*******************************************************************************/

MQTTBrokerDefESP32::MQTTBrokerDefESP32(const char* LABEL) : MQTTBrokerDef(LABEL) {
  cli_conf = {
    .broker = {
      .address = {
        .uri = _uri,
      }
    },
    .credentials = {
      .username = _usr,
      .authentication = {
        .password = _pass,
      }
    },
    .session = {
      .last_will = {
        .topic = "/topic/will",
        .msg = "i will leave",
        .msg_len = 12,
        .qos = 1,
        .retain = true,
      },
      .protocol_ver = MQTT_PROTOCOL_V_5,
    },
    .network = {
      .disable_auto_reconnect = true,
    },
    .buffer = {
      .size = MQTT_MAX_PACKET_SIZE,
      .out_size = MQTT_MAX_PACKET_SIZE,
    },
  };
}



/*******************************************************************************
* MQTTClientESP32
*******************************************************************************/

/*
* Constructor
*/
MQTTClientESP32::MQTTClientESP32() :
  StateMachine<MQTTCliState>("MQTTClientESP32-FSM", &_FSM_STATES, MQTTCliState::UNINIT, 8)
{
  _radio = nullptr;
  _client_handle = nullptr;

  // Policy defaults.
  _flags.set(MQTT_FLAG_AUTOCONNECT, true);
  _flags.set(MQTT_FLAG_SUBS_COMPLETE, false);

  // Backoff defaults.
  _reconnect_backoff_ms     = 5000;
  _reconnect_backoff_ms_max = 60000;

  _connect_attempt_active     = false;
  _mqtt_connected_latched     = false;
  _mqtt_disconnected_latched  = false;

  _sub_cursor         = 0;
  _sub_pending_msg_id = -1;
  _mb_suback_msg_id   = -1;
}


/*
* Destructor
*/
MQTTClientESP32::~MQTTClientESP32() {}


int8_t MQTTClientESP32::init() {
  int8_t ret = 0;
  // Do not imply "connect now". We idle in DISCONNECTED and let policy drive.
  _fsm_set_route(2, MQTTCliState::INIT, MQTTCliState::DISCONNECTED);
  return ret;
}


bool MQTTClientESP32::setBroker(MQTTBrokerDef* n_broker) {
  return _current_broker.set(n_broker);
}


/*******************************************************************************
* Mailbox helpers (event-loop context)
*******************************************************************************/
void MQTTClientESP32::_mb_set_mqtt_connected(const bool v) { _mb_mqtt_connected = v; }
void MQTTClientESP32::_mb_set_mqtt_disconnected(const bool v) { _mb_mqtt_disconnected = v; }


/**
* Called when any broker property changes.
* Clears init flags and plans a regression to INIT (disconnecting first if needed).
*/
void MQTTClientESP32::_broker_changed_reinit_plan() {
  // Clear things that are specific to the current client handle.
  _flags.clear(MQTT_FLAG_ESP_MQTT_INIT | MQTT_FLAG_EVENT_REGISTERED);

  // Any in-flight attempt should be considered invalid now.
  _connect_attempt_active = false;
  _mqtt_connected_latched = false;
  _mqtt_disconnected_latched = false;

  // Ensure we end up in INIT so that the client handle is rebuilt using new broker config.
  // If currently connected, we must gracefully stop first.
  if (connected()) {
    // Blow out our existing state plan with one that
    _fsm_set_route(4, MQTTCliState::DISCONNECTING, MQTTCliState::DISCONNECTED, MQTTCliState::INIT, MQTTCliState::DISCONNECTED);
  }
  else {
    // If we're CONNECTING/DISCONNECTED/INIT, just ensure INIT is next so it rebuilds.
    _fsm_prepend_state(MQTTCliState::INIT);
  }
}



/**
*
* @return 0 on success, or negative on failure
*/
int MQTTClientESP32::publish(MQTTMessage* msg) {
  int ret = -1;
  if (connected()) {
    const uint8_t QOS = 0;
    // Use the non-blocking outbox API.
    // TODO: Even though we don't get a msg_id back.
    //msg_id = esp_mqtt_client_enqueue(_client_handle, msg->topic, msg->data.string(), msg->data.length(), msg->qos, (msg->retain ? 1:0), true);
    //if (msg_id) {}
    if (ESP_OK == esp_mqtt_client_enqueue(_client_handle, msg->topic, (const char*) msg->data.string(), msg->data.length(), msg->qos, (msg->retain ? 1:0), true)) {
      msg->msg_id = 0;
      ret = 0;
    }
  }
  return ret;
}


/**
*
* @return topic_idx on success, or negative on failure
*/
int MQTTClientESP32::subscribe(const char* TOPIC_STR, const uint8_t QOS) {
  int msg_id = -1;
  if (connected()) {
    msg_id = esp_mqtt_client_subscribe_single(_client_handle, TOPIC_STR, QOS);
  }
  return msg_id;
}


/**
*
* @return topic_idx on success, or negative on failure
*/
int MQTTClientESP32::unsubscribe(const char* TOPIC_STR) {
  int msg_id = -1;
  if (connected()) {
    msg_id = esp_mqtt_client_unsubscribe(_client_handle, TOPIC_STR);
  }
  return msg_id;
}


/**
*
* @return PollResult
*/
FAST_FUNC PollResult MQTTClientESP32::poll() {
  // Latch mailboxes (event-loop -> poll/FSM context).
  if (_mb_mqtt_connected) {
    _mqtt_connected_latched = true;
    _mqtt_disconnected_latched = false;
    _mb_mqtt_connected = false;
  }
  if (_mb_mqtt_disconnected) {
    _mqtt_connected_latched = false;
    _mqtt_disconnected_latched = true;
    _mb_mqtt_disconnected = false;
  }

  // SUBACK mailbox handling.
  if (_mb_suback_msg_id >= 0) {
    // Only accept if it matches current pending.
    if (_sub_pending_msg_id == _mb_suback_msg_id) {
      _sub_pending_msg_id = -1;
      _sub_cursor++;
    }
    _mb_suback_msg_id = -1;
  }

  return ((0 == _fsm_poll()) ? PollResult::NO_ACTION : PollResult::ACTION);
}



/**
* Called in idle time by the firmware to prod the driver's state machine forward.
*
* @return  1 on state shift
*          0 on no action
*         -1 on error
*/
FAST_FUNC int8_t MQTTClientESP32::_fsm_poll() {
  int8_t ret = 0;
  bool fsm_advance = false;

  switch (currentState()) {
    case MQTTCliState::UNINIT:
      fsm_advance = _fsm_is_next_pos(MQTTCliState::INIT);
      break;

    case MQTTCliState::INIT:
      fsm_advance = initialized();
      break;

    // Exit conditions:
    //   - if network not ready: park
    //   - if mqtt event says connected: advance
    //   - if mqtt event says disconnected/error: park (and backoff applies at DISCONNECTED entry)
    case MQTTCliState::CONNECTING:
      if ((nullptr == _radio) || !_radio->linkUp() || !_radio->hasIP()) {
        fsm_advance = (0 == _fsm_prepend_state(MQTTCliState::DISCONNECTED));
      }
      else if (_mqtt_connected_latched) {
        fsm_advance = true;
      }
      else if (_mqtt_disconnected_latched) {
        fsm_advance = (0 == _fsm_prepend_state(MQTTCliState::DISCONNECTED));
      }
      break;

    case MQTTCliState::CONNECTED:
      if (_fsm_is_stable()) {
        // Network collapse -> stop client, then park.
        if ((nullptr == _radio) || !_radio->linkUp() || !_radio->hasIP()) {
          fsm_advance = (0 == _fsm_append_route(2, MQTTCliState::DISCONNECTING, MQTTCliState::DISCONNECTED));
        }
        // MQTT collapse -> park.
        else if (!_mqtt_connected_latched || _mqtt_disconnected_latched) {
          fsm_advance = (0 == _fsm_append_state(MQTTCliState::DISCONNECTED));
        }
      }
      fsm_advance = !_fsm_is_stable();
      break;

    case MQTTCliState::DISCONNECTING:
      fsm_advance = !_fsm_is_stable();
      break;

    // Greedy policy is applied here (while stable).
    case MQTTCliState::DISCONNECTED:
      if (_fsm_is_stable()) {
        const bool greedy = (autoconnect() && _current_broker.autoconnect() && _current_broker.isValid());
        const bool net_ok = ((nullptr != _radio) && _radio->linkUp() && _radio->hasIP());
        if (greedy && net_ok) {
          _fsm_append_route(2, MQTTCliState::CONNECTING, MQTTCliState::CONNECTED);
        }
      }
      fsm_advance = !_fsm_is_stable();
      break;

    case MQTTCliState::FAULT:
      break;

    default:
      ret = -1;
      break;
  }

