jspark311/ManuvrPlatforms/ESP32/src/MQTT.cpp
  if (fsm_advance & (-1 != ret)) {
    ret = (0 == _fsm_advance()) ? 1 : 0;
  }
  return ret;
}


/**
* Attempt a state entry.
*
* @return 0 on success, -1 otherwise.
*/
FAST_FUNC int8_t MQTTClientESP32::_fsm_set_position(MQTTCliState new_state) {
  int8_t ret = -1;
  const MQTTCliState CURRENT_STATE = currentState();
  if (_fsm_is_waiting()) return ret;

  bool state_entry_success = false;

  switch (new_state) {
    case MQTTCliState::UNINIT:
      _set_fault("Tried to _fsm_set_position(UNINIT)");
      break;

    case MQTTCliState::INIT:
      if (!_flags.value(MQTT_FLAG_EVENT_LOOP_CREATED)) {
        switch (esp_event_loop_create_default()) {
          case ESP_OK:
          case ESP_ERR_INVALID_STATE:
            _flags.set(MQTT_FLAG_EVENT_LOOP_CREATED);
            break;
          default:
            _set_fault("Unable to create default event loop.");
            break;
        }
      }

      // If we're re-initting, tear down prior handle first.
      if (nullptr != _client_handle) {
        // Stop is safe here (not in event handler stack).
        esp_mqtt_client_stop(_client_handle);
        esp_mqtt_client_destroy(_client_handle);
        _flags.clear(MQTT_FLAG_ESP_MQTT_INIT);
        _client_handle = nullptr;
      }

      if (!_flags.value(MQTT_FLAG_ESP_MQTT_INIT) & _current_broker.isValid()) {
        // (Re)create client and register event handler.
        _client_handle = esp_mqtt_client_init(_current_broker.config());
        _flags.set(MQTT_FLAG_ESP_MQTT_INIT, (nullptr != _client_handle));
      }

      if (_flags.value(MQTT_FLAG_ESP_MQTT_INIT)) {
        switch (esp_mqtt_client_register_event(_client_handle, (esp_mqtt_event_id_t) ESP_EVENT_ANY_ID, mqtt_event_handler, this)) {
          case ESP_OK:
            _flags.set(MQTT_FLAG_EVENT_REGISTERED);
            break;
          default:
            _set_fault("Unable to esp_mqtt_client_register_event().");
            break;
        }
      }
      state_entry_success = initialized();
      break;

    case MQTTCliState::CONNECTING:
      if ((nullptr != _radio) && _radio->linkUp() && _radio->hasIP() && _current_broker.isValid() && initialized()) {
        _connect_attempt_active = true;
        _mqtt_disconnected_latched = false;  // Clear stale disconnect latch before attempt.
        state_entry_success = (ESP_OK == esp_mqtt_client_start(_client_handle));
      }
      break;

    case MQTTCliState::CONNECTED:
      // Success resets backoff.
      _connect_attempt_active = false;
      _reconnect_backoff_ms = 5000;
      _mqtt_disconnected_latched = false;
      {
        StringBuilder* subs = _current_broker.subs();
        for (int i = 0; i < subs->count(); i++) {
          subscribe(subs->position(i), 0);
        }
      }
      state_entry_success = true;
      break;

    case MQTTCliState::DISCONNECTING:
      _connect_attempt_active = false;
      // NOTE: esp_mqtt_client_stop() must not be called from the event handler's stack frame.
      if (nullptr != _client_handle) {
        state_entry_success = (ESP_OK == esp_mqtt_client_stop(_client_handle));
      }
      else {
        state_entry_success = true;
      }
      break;

    case MQTTCliState::DISCONNECTED:
      state_entry_success = true;

      // Apply lockout ONLY if we were actively attempting a connection and ended up here.
      if (_connect_attempt_active) {
        _connect_attempt_active = false;

        const bool greedy = (autoconnect() && _current_broker.autoconnect() && _current_broker.isValid());
        if (greedy) {
          _fsm_lockout(_reconnect_backoff_ms);

          if (_reconnect_backoff_ms < _reconnect_backoff_ms_max) {
            uint32_t next = (_reconnect_backoff_ms << 1);
            _reconnect_backoff_ms = (next > _reconnect_backoff_ms_max) ? _reconnect_backoff_ms_max : next;
          }
        }
      }
      break;

    case MQTTCliState::FAULT:
      state_entry_success = true;
      _set_fault("Explicit FSM waypoint");
      break;

    default:
      _set_fault("Unhandled MQTTCliState");
      break;
  }

  if (state_entry_success) {
    if (_log_verbosity >= LOG_LEV_NOTICE) {
      c3p_log(LOG_LEV_NOTICE, "MQTTClientESP32::_fsm_set_position",
        "MQTTClientESP32 State %s ---> %s",
        _FSM_STATES.enumStr(CURRENT_STATE), _FSM_STATES.enumStr(new_state)
      );
    }
    ret = 0;
  }

  return ret;
}


/**
* Put the driver into a FAULT state.
*/
void MQTTClientESP32::_set_fault(const char* msg) {
  if (_log_verbosity >= LOG_LEV_WARN) c3p_log(LOG_LEV_WARN, "MQTTClientESP32::_set_fault", "MQTTClientESP32 fault: %s", msg);
  _fsm_mark_current_state(MQTTCliState::FAULT);
}


/*******************************************************************************
* MQTT console support
*******************************************************************************/

void MQTTClientESP32::printDebug(StringBuilder* output) {
  StringBuilder tmp;
  StringBuilder prod_str("MQTTClientESP32");
  prod_str.concatf(" [%sinitialized]", (initialized() ? "" : "un"));
  StringBuilder::styleHeader2(&tmp, (const char*) prod_str.string());
  printFSM(&tmp);

  tmp.concatf("\t Client autoconnect: %c\n", (autoconnect() ? 'y' : 'n'));
  tmp.concatf("\t Broker autoconnect: %c\n", (_current_broker.autoconnect() ? 'y' : 'n'));
  tmp.concatf("\t Broker valid:       %c\n", (_current_broker.isValid() ? 'y' : 'n'));
  tmp.concatf("\t Subs complete:      %c\n", (_flags.value(MQTT_FLAG_SUBS_COMPLETE) ? 'y' : 'n'));
  tmp.concatf("\t Subs cursor:        %d\n", _sub_cursor);
  tmp.concatf("\t Backoff:            %u ms (max %u)\n", _reconnect_backoff_ms, _reconnect_backoff_ms_max);

  if (initialized()) {
    if (connected()) {
      tmp.concat("Connected to broker:\n");
      _current_broker.printDebug(&tmp);
    }
    if (nullptr != _radio) {
      tmp.concatf("\t Radio link:    %c\n", (_radio->linkUp() ? 'y' : 'n'));
      tmp.concatf("\t Radio hasIP:   %c\n", (_radio->hasIP() ? 'y' : 'n'));
      if (_radio->hasIP()) {
        const uint32_t ip = _radio->ip4();
        tmp.concatf("\t Radio IPv4:    %u.%u.%u.%u\n",
          (ip & 0xFF), ((ip >> 8) & 0xFF), ((ip >> 16) & 0xFF), ((ip >> 24) & 0xFF));
      }
    }
    else {
      tmp.concat("\t Radio:         [UNBOUND]\n");
    }
  }
  else {
    tmp.concatf("\t ESP_MQTT_INIT:      %c\n", (_flags.value(MQTT_FLAG_ESP_MQTT_INIT) ? 'y' : 'n'));
    tmp.concatf("\t EVENT_REGISTERED:   %c\n", (_flags.value(MQTT_FLAG_EVENT_REGISTERED) ? 'y' : 'n'));
    tmp.concatf("\t EVENT_LOOP_CREATED: %c\n", (_flags.value(MQTT_FLAG_EVENT_LOOP_CREATED) ? 'y' : 'n'));
  }

  tmp.string();
  output->concatHandoff(&tmp);
}



