jspark311/ManuvrPlatforms/ESP32/src/MQTT.cpp
int MQTTClientESP32::console_handler_mqtt_client(StringBuilder* txt_ret, StringBuilder* args) {
  int ret = 0;
  char* cmd = args->position_trimmed(0);

  if (0 == StringBuilder::strcasecmp(cmd, "sub")) {
    bool print_usage = false;
    if (1 < args->count()) {
      char* topic = args->position_trimmed(1);
      uint8_t qos = ((uint8_t) args->position_as_int(2)) & 3;
      txt_ret->concatf("subscribe(%s, %s) returned %d.\n", topic, qos, subscribe(topic, qos));
    }
    else {
      print_usage = true;
    }
    if (print_usage) {  txt_ret->concatf("Usage: %s <topic [qos]> ...\n", cmd); }
  }
  if (0 == StringBuilder::strcasecmp(cmd, "unsub")) {
    bool print_usage = false;
    if (1 < args->count()) {
      char* topic = args->position_trimmed(1);
      txt_ret->concatf("unsubscribe(%s) returned %d.\n", topic, unsubscribe(topic));
    }
    else {
      print_usage = true;
    }
    if (print_usage) {  txt_ret->concatf("Usage: %s <topic> ...\n", cmd); }
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "broker")) {
    //m broker home mqtt://192.168.0.3 dgmj-mqtt dgmj-mqtt
    args->drop_position(0);
    ret = _current_broker.console_handler(txt_ret, args);  // Shunt into the BrokerDef console handler.
    if (4 == args->count()) {
      // If a full broker was defined, reconnect.
      _broker_changed_reinit_plan();
      txt_ret->concat("Attempting to connect to new broker...\n");
    }
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "auto")) {
    if (2 == args->count()) {
      autoconnect(0 != args->position_as_int(1));
    }
    txt_ret->concatf("MQTTClientESP32 autoconnect: %c\n", (autoconnect() ? 'y' : 'n'));
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "brokerauto")) {
    if (2 == args->count()) {
      _current_broker.autoconnect(0 != args->position_as_int(1));
    }
    txt_ret->concatf("Broker autoconnect: %c\n", (_current_broker.autoconnect() ? 'y' : 'n'));
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "backoff")) {
    txt_ret->concatf("Backoff: %u ms (max %u)\n", _reconnect_backoff_ms, _reconnect_backoff_ms_max);
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "max_backoff")) {
    if (2 == args->count()) {
      uint32_t v = (uint32_t) args->position_as_int(1);
      // Clamp to something sane: at least 1000ms and not 0.
      _reconnect_backoff_ms_max = strict_max(v, (uint32_t) 1000);
      if (_reconnect_backoff_ms > _reconnect_backoff_ms_max) {
        _reconnect_backoff_ms = _reconnect_backoff_ms_max;
      }
    }
    txt_ret->concatf("Max backoff: %u ms\n", _reconnect_backoff_ms_max);
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "con")) {
    // User intent: re-enable greedy connect.
    autoconnect(true);
    if (!connected()) {
      ret = _fsm_append_route(2, MQTTCliState::CONNECTING, MQTTCliState::CONNECTED);
    }
    else {
      txt_ret->concat("MQTTClientESP32 is already connected.\n");
    }
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "discon")) {
    // User intent: override greedy connect (stay parked).
    autoconnect(false);
    if (connected()) {
      ret = _fsm_append_route(2, MQTTCliState::DISCONNECTING, MQTTCliState::DISCONNECTED);
    }
    else {
      // Ensure we are parked and stable.
      ret = _fsm_prepend_state(MQTTCliState::DISCONNECTED);
    }
  }
  else if (0 == StringBuilder::strcasecmp(cmd, "fsm")) {
    args->drop_position(0);
    ret = fsm_console_handler(txt_ret, args);  // Shunt into the FSM console handler.
  }
  else {
    printDebug(txt_ret);
  }

  return ret;
}
